js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void cmd_4byte(int argc, char **argv)
{
   bool enter;
   if (argc > 0)
      enter = arg_u32(argv[0], 0U) != 0U;
   else
      enter = !four_byte_mode;
   uint8_t opc = enter ? 0xB7U : 0xE9U;
   const qspi_cmd_t c = {
      .instruction = opc, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR 4byte\r\n");
      return;
   }
   four_byte_mode = enter;
   my_printf("4byte=%d (op=%02x)\r\n", enter ? 1 : 0, (unsigned)opc);
}

static void cmd_reset(void)
{
   const qspi_cmd_t a = { .instruction = 0x66U, .inst_lines = QSPI_LINES_1 };
   const qspi_cmd_t b = { .instruction = 0x99U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&a, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK ||
       qspi_xfer(&b, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR reset\r\n");
      return;
   }
   my_printf("reset (66 99) sent\r\n");
}

static void cmd_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xB9U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR dpd\r\n");
      return;
   }
   my_printf("op=b9 deep power-down\r\n");
}

static void cmd_release_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xABU, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR rdpd\r\n");
      return;
   }
   my_printf("op=ab release DPD\r\n");
}

static void cmd_prescaler(int argc, char **argv)
{
   uint32_t p = arg_u32(argc > 0 ? argv[0] : NULL, qspi_get_prescaler());
   if (p > 255U) {
      my_printf("ERR presc range\r\n");
      return;
   }
   /* Enable 1/2-cycle sample shift at high SCLK by default, but allow
    * manual override for FPGA timing bring-up. */
   const uint32_t sshift = arg_u32(argc > 1 ? argv[1] : NULL,
                                   (p <= 5U) ? 1U : 0U) ? 1U : 0U;
   if (qspi_init(p, qspi_get_fsize(), qspi_get_csht(), sshift, false)
       != HAL_OK) {
      my_printf("ERR reinit\r\n");
      return;
   }
   busy_flag = true;
   my_printf("presc=%lu sshift=%lu\r\n",
             (unsigned long)p, (unsigned long)sshift);
}

/* -------- raw GPIO bring-up helpers ------------------------------- */

struct pin_def {
   GPIO_TypeDef *port;
   uint32_t      pin;
   const char   *name;
};

static const struct pin_def pins[6] = {
   { QSPI_CLK_PORT, QSPI_CLK_PIN, "CLK" },
   { QSPI_NCS_PORT, QSPI_NCS_PIN, "NCS" },
   { QSPI_IO0_PORT, QSPI_IO0_PIN, "IO0" },
   { QSPI_IO1_PORT, QSPI_IO1_PIN, "IO1" },
   { QSPI_IO2_PORT, QSPI_IO2_PIN, "IO2" },
   { QSPI_IO3_PORT, QSPI_IO3_PIN, "IO3" },
};

static void config_gpio_pin(int i, uint32_t mode)
{
   GPIO_InitTypeDef g = {
      .Pin   = pins[i].pin,
      .Mode  = mode,
      .Pull  = GPIO_NOPULL,
      .Speed = GPIO_SPEED_FREQ_VERY_HIGH,
   };
   HAL_GPIO_Init(pins[i].port, &g);
}

static void force_gpio_outputs(void)
{
   QUADSPI->CR &= ~QUADSPI_CR_EN;
   for (int i = 0; i < 6; i++)
      config_gpio_pin(i, GPIO_MODE_OUTPUT_PP);
}

static void force_gpio_inputs(void)
{
   QUADSPI->CR &= ~QUADSPI_CR_EN;
   for (int i = 0; i < 6; i++)
      config_gpio_pin(i, GPIO_MODE_INPUT);
}

static void gpio_write_idx(int i, uint32_t high)
{
   HAL_GPIO_WritePin(pins[i].port, pins[i].pin,
                     high ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static uint32_t gpio_read_idx(int i)
{
   return HAL_GPIO_ReadPin(pins[i].port, pins[i].pin) == GPIO_PIN_SET;
}

static void gpio_bitbang_delay(void)
{
   for (volatile uint32_t i = 0; i < 20U; i++)
      __asm volatile("nop");
}

static void gpio_prepare_bitbang(void)
{
   QUADSPI->CR &= ~QUADSPI_CR_EN;
   config_gpio_pin(0, GPIO_MODE_OUTPUT_PP); /* CLK */
   config_gpio_pin(1, GPIO_MODE_OUTPUT_PP); /* NCS */
   for (int i = 2; i < 6; i++)
      config_gpio_pin(i, GPIO_MODE_INPUT);
   gpio_write_idx(0, 0U);
   gpio_write_idx(1, 1U);
   gpio_bitbang_delay();
}

static uint32_t gpio_clock_sample_nibble(void)
{
   gpio_write_idx(0, 0U);
   gpio_bitbang_delay();
   gpio_write_idx(0, 1U);
   gpio_bitbang_delay();
   return gpio_read_idx(2) | (gpio_read_idx(3) << 1) |
          (gpio_read_idx(4) << 2) | (gpio_read_idx(5) << 3);
}

static void cmd_gpio(int argc, char **argv)
{
   uint32_t mask = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   /* Disabling QUADSPI breaks the auto-JEDEC loop; suspend it. */
   busy_flag = true;
   force_gpio_outputs();
   for (int i = 0; i < 6; i++) {
      GPIO_PinState s = (mask >> i) & 1U ? GPIO_PIN_SET : GPIO_PIN_RESET;
      HAL_GPIO_WritePin(pins[i].port, pins[i].pin, s);
   }
   my_printf("gpio mask=0x%02lx:", (unsigned long)mask);
   for (int i = 0; i < 6; i++) {
      int rb = HAL_GPIO_ReadPin(pins[i].port, pins[i].pin) == GPIO_PIN_SET;
      my_printf(" %s=%d", pins[i].name, rb);
   }
   my_printf("\r\n");
}

static void cmd_gpio_read(void)
{
   busy_flag = true;
   force_gpio_inputs();
   my_printf("gpio read:");
   for (int i = 0; i < 6; i++) {
      int rb = HAL_GPIO_ReadPin(pins[i].port, pins[i].pin) == GPIO_PIN_SET;
      my_printf(" %s=%d", pins[i].name, rb);
   }
   my_printf("\r\n");
}

static void cmd_gpio_bitbang_read(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 16U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t io   = arg_u32(argc > 2 ? argv[2] : NULL, 1U);
   if (len > READ_CAP)
      len = READ_CAP;
   if (io > 3U) {
      my_printf("ERR io range\r\n");
      return;
   }

   busy_flag = true;
   gpio_prepare_bitbang();
   gpio_write_idx(1, 0U);
   gpio_bitbang_delay();

   for (uint32_t n = 0; n < len; n++) {
      uint8_t v = 0U;
      if (quad) {
         uint32_t lo = gpio_clock_sample_nibble();
         uint32_t hi = gpio_clock_sample_nibble();
         v = (uint8_t)(lo | (hi << 4));
      } else {
         int pin = 2 + (int)io;
         for (int bit = 7; bit >= 0; bit--) {
            gpio_write_idx(0, 0U);
            gpio_bitbang_delay();
            gpio_write_idx(0, 1U);
            gpio_bitbang_delay();
            if (gpio_read_idx(pin))
               v |= (uint8_t)(1U << bit);
         }
      }
      io_buf[n] = v;
   }

   gpio_write_idx(0, 0U);
   gpio_write_idx(1, 1U);
   if (quad)
      my_printf("bb read %lu (quad)\r\n", (unsigned long)len);
   else
      my_printf("bb read %lu (1lane io=%lu)\r\n",
                (unsigned long)len, (unsigned long)io);
   hexdump(0U, io_buf, len);
}

static void cmd_toggle(int argc, char **argv)
{
   uint32_t per = arg_u32(argc > 0 ? argv[0] : NULL, 1U);
   force_gpio_outputs();
   my_printf("toggle period=%lu ms (reset to stop)\r\n",
             (unsigned long)per);
   busy_flag = true;
   uint32_t lvl = 0;
   while (1) {
      for (int i = 0; i < 6; i++)
         HAL_GPIO_WritePin(pins[i].port, pins[i].pin,
                           lvl ? GPIO_PIN_SET : GPIO_PIN_RESET);
      lvl ^= 1U;
      HAL_Delay(per);
   }
}

static void cmd_abort(void)
{
   qspi_abort();
   /* drain RX FIFO of any leftover data from a botched read */
   while (QUADSPI->SR & QUADSPI_SR_FTF)
      (void)QUADSPI->DR;
   my_printf("abort\r\n");
}

/* -------- dispatch ------------------------------------------------ */

static void dispatch(char *line)
{
   while (*line == ' ' || *line == '\t')
      line++;
   if (!*line)
      return;
   char op = *line++;
   while (*line == ' ' || *line == '\t')
      line++;

   /* chip-erase double-tap confirmation */
   if (op == 'C' && pend_confirm_C_until &&
       (int32_t)(HAL_GetTick() - pend_confirm_C_until) < 0) {
      pend_confirm_C_until = 0;
      cmd_chip_erase_do();
      return;
   }
   pend_confirm_C_until = 0;

